dftpnk-emacs.org
#+title Deftpunk Emacs
#+author: Erick Bodine <erick.bodine@gmail.com>
#+property: header-args :tangle "/Users/bodine/MyStuff/dftpunk-emacs/init.el"
#+startup: content
#+auto_tangle: t

* About

My version of Emacs for MacOS - an attempt to be more minimalistic &
use builtin functionality.  All of which is, of course, relative.

** Installation

My notes for installing from scratch.

Dependencies:
- zsh + oh-my-zsh
- git
- ripgrep
- cmake   -> for compiling libvterm

I am using emacs-plus: https://github.com/d12frosted/homebrew-emacs-plus

1. brew tap d12frosted/emacs-plus
2. brew install emacs-plus@29 --with-imagemagick --with-native-comp --with-poll

Clone this dotfiles repository.

Run =emacs --quick --script ~/.emacs.d/scripts/get-env.el= to generate the environment variables file.

* Early-Init
:properties:
:header-args: :tangle "/Users/bodine/MyStuff/dftpunk-emacs/early-init.el"
:end:
#+name: early-init-header-block
#+begin_src emacs-lisp :exports none
;;; early-init.el --- deftpunk early-init file. -*- lexical-binding: t; buffer-read-only: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/dftpnk-emacs.org
;;;
;;; Code:
#+end_src

** Startup message

#+begin_src emacs-lisp :name startup-hook
  ;; Time how long Emacs starts up.
  ;; Use a hook so the message doesn't get clobbered by other messages.
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+end_src

** Environmental variables

Using a different methology instead of exec-path-from-shell to set environment variables.

https://roamingbytes.substack.com/p/emacs-on-macos-preserving-the-correct-environment-1735d2e8cb88
https://github.com/doomemacs/doomemacs/blob/master/lisp/cli/env.el#L53

A modest gist of bash/zsh shell configuration on MacOS from the perspective of setting PATH.
https://gist.github.com/Linerre/f11ad4a6a934dcf01ee8415c9457e7b2

#+begin_src emacs-lisp :name environment-setup
  (defun load-env-file (file)
    "Read and set envvars from FILE."
    (if (null (file-exists-p file))
        (signal 'file-error
                (list "No envvar file exists." file
                      "Run `emacs --quick --script ~/.emacs.d/scripts/gen-env-file.el` from a terminal."))
      (with-temp-buffer
        (insert-file-contents file)
        (when-let (env (read (current-buffer)))
          (let ((tz (getenv-internal "TZ")))
            (setq-default
             process-environment
             (append env (default-value 'process-environment))
             exec-path
             (append (split-string (getenv "PATH") path-separator t)
                     (list exec-directory))
             shell-file-name
             (or (getenv "SHELL")
                 (default-value 'shell-file-name)))
            (when-let (newtz (getenv-internal "TZ"))
              (unless (equal tz newtz)
                (set-time-zone-rule newtz))))
          env))))

  (load-env-file "~/.emacs.d/var/env.el")

  ;; Mostly prevents libgccjit errors; manually setting to the latest gcc path is brittle.
  ;; I had to uninstall/re-install, then run `emacs -nw` to get the native-comp to work properly.
  ;; Solution found at: https://github.com/d12frosted/homebrew-emacs-plus/issues/554
  (setenv "LIBRARY_PATH"
          (string-join
           '("/opt/homebrew/opt/gcc/lib/gcc/13"
             "/opt/homebrew/opt/libgccjit/lib/gcc/13"
             "/opt/homebrew/opt/gcc/lib/gcc/13/gcc/aarch64-apple-darwin21/13")
           ":"))
#+end_src

** Adjust garbage collection & other startup/performance optimizations

You'll see this modification in many config files around the internet. The idea is that emacs sets it's memory
threshold 40 years in the past. This causes the garbage collector to run frequently and can cause delays or
muck up the speed of your setup. We pretty much disable garbage collection during the initial phase to improve
our startup time. After we have given enough time for everything to load we then set the gc-theshold to a
reasonable number. Sometimes people set the threshold back to its default value, but I keep it a little higher
to handle things like fuzzy completion and language-server requirements. (See also GCMH Mode)

Some of the things in here may be cargo culting so .... caveat emptor.

#+begin_src emacs-lisp :name garbage-collection

  (defvar default-file-name-handler-alist file-name-handler-alist)
  (defvar extended-gc-cons-threshold most-positive-fixnum)
  (defvar default-gc-cons-threshold (* 100 1024 1024))

  ;; Native Compilation Vars
  (when (featurep 'native-compile)
    (setq native-comp-speed 2
          native-comp-async-report-warnings-errors nil
          native-comp-deferred-compilation t)
    ;; Set the right directory to store the native compilation cache
    ;; NOTE the method for setting the eln-cache directory depends on the emacs version
    (when (fboundp 'startup-redirect-eln-cache)
      (if (version< emacs-version "29")
          (add-to-list 'native-comp-eln-load-path (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))
        (startup-redirect-eln-cache (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory))))))

  (setq-default auto-window-vscroll nil
                bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right
                frame-inhibit-implied-resize t
                inhibit-default-init t
                site-run-file nil
                load-prefer-newer t)

  ;; 02/28/24 19:36:07
  ;; Looks like read-process-output-max can't be fine tuned on MacOS.  Its stuck at 64kb.  Maybe the patch to Emacs30 will help(?).
  ;; https://github.com/emacs-lsp/lsp-mode/discussions/3561
  ;; (read-process-output-max (* 1024 1024 3))

  (setq file-name-handler-alist nil
        package-enable-at-startup nil
        gc-cons-threshold extended-gc-cons-threshold)

  (defun arco/return-gc-to-default ()
    (setq-default gc-cons-threshold default-gc-cons-threshold
                  load-prefer-newer nil))

  (defun arco/reset-file-handler-alist-h ()
    (dolist (handler file-name-handler-alist)
      (add-to-list 'default-file-name-handler-alist handler))
    (setq file-name-handler-alist default-file-name-handler-alist))

  (defun deftpunk/startup-time ()
    "Display garbage collections and startup time."
    (let ((garbage-collection-messages t)) (garbage-collect))
    (let ((msg (format "started (%d) in %s" (emacs-pid) (emacs-init-time))))
      (message (concat "emacs: " msg))))

  (add-hook 'after-init-hook #'arco/reset-file-handler-alist-h)
  (add-hook 'after-init-hook #'arco/return-gc-to-default)
  (add-hook 'after-init-hook #'deftpunk/startup-time)
  (advice-add #'package--ensure-init-file :override #'ignore)

  ;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
  ;; compiled ahead-of-time when they are installed and site files are compiled
  ;; when gccemacs is installed.
  (setq comp-deferred-compilation nil)

  ;; remove searching for .gz files, as all my packages are uncompressed
  ;; this halves how many files emacs tries to open (if you have a lot of
  ;; packages, emacs executes a lot of failing file opens)
  (setq jka-compr-load-suffixes nil)
  (jka-compr-update)
#+end_src

** Pre-Gui Configuration & Optimization

Ever since Emacs 27.0 we can utilize the early-init file to setup a few graphical settings without seeing a
major slow down. The biggest speed ups I've seen from this is setting =vertical-scroll-bars= , =ns-appearance=,
and =ns-transparent-titlebar=.  We also handle a few other graphical settings.

#+begin_src emacs-lisp :name gui-optimization
  ;; Some nice UI tweaks that improve performance when specified
  ;; in early-init.el
  (modify-all-frames-parameters '((width . 105)
                                  (height . 100)
                                  (left . 0)
                                  (right . 0)
                                  (internal-border-width . 1)
                                  (vertical-scroll-bars . nil)
                                  (tool-bar-lines . 0)
                                  (ns-appearance . dark)
                                  ))

  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t)

  ;; Get rid of any window chrome.
  (when window-system
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (tooltip-mode -1))
  (setq inhibit-splash-screen t)
  (setq use-file-dialog nil)

  ;; Want square corners when no titlebars
  ;; 2023-08-11T22:19:27 > this looks funky w/out a tiling window manager.
  ;; (add-to-list 'default-frame-alist '(undecorated . t))

#+end_src

** UTF-8

Set everything to UTF-8

#+begin_src emacs-lisp :name utf-8
  (setq default-input-method nil
        utf-translate-cjk-mode nil)
  (set-language-environment 'utf-8)

  ;; Make UTF-8 the default coding system.
  (when (fboundp 'set-charset-priority)
    (set-charset-priority 'unicode))
  (prefer-coding-system 'utf-8)
  (setq locale-coding-system 'utf-8
        selection-coding-system 'utf-8)

  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+end_src

** Bonus keys

This allows us of C-i, C-m & C-[ ... you know, like other editors can.
https://emacsnotes.wordpress.com/2022/09/11/three-bonus-keys-c-i-c-m-and-c-for-your-gui-emacs-all-with-zero-headache/

#+begin_src emacs-lisp :name bonus-keys
  (add-hook
   'after-make-frame-functions
   (defun setup-blah-keys (frame)
     (with-selected-frame frame
       (when (display-graphic-p) ; don't remove this condition, if you want
                                          ; terminal Emacs to be usable
         ;; - When you type `Ctrl-i', Emacs see it as `BLAH-i', and NOT as 'Tab'
         ;; - When you type `Ctrl-m', Emacs see it as `BLAH-m', and NOT as 'Return'
         ;; - When you type `Ctrl-[', Emacs see it as `BLAH-lsb', and not as 'Esc'.
         ;;
         ;; That is,
         ;;
         ;; - `Ctrl-i' and 'Tab' keys are different
         ;; - `Ctrl-m' and 'Return' keys are different
         ;; - `Ctrl-[' and 'Esc' keys are different
         ;;
         ;; The three BLAH keys are the bonus keys.
         (define-key input-decode-map (kbd "C-i") [BLAH-i])
         (define-key input-decode-map (kbd "C-[") [BLAH-lsb]) ; left square bracket
         (define-key input-decode-map (kbd "C-m") [BLAH-m])
         ;; You can replace `BLAH-' above with `C-' or
         ;; `CONTROL-', it doesnt' matter.
         ;;
         ;; BLAH is merely a symbol / name; feel free to change
         ;; it to whatever you like .
         ))))
#+end_src

** Early key unset/set

#+begin_src emacs-lisp :name unset-set-keys
  ;; Unbind some Super keys.
  (global-unset-key (kbd "s-a"))
  (global-unset-key (kbd "s-f"))
  (global-unset-key (kbd "s-g"))
  (global-unset-key (kbd "s-i"))
  (global-unset-key (kbd "s-o"))
  (global-unset-key (kbd "s-p"))
  (global-unset-key (kbd "s-s"))
  (global-unset-key (kbd "s-t"))
  (global-unset-key (kbd "s-y"))
#+end_src

#+name: early-init-footer-block
#+begin_src emacs-lisp :exports none
(provide 'early-init)
;;; early-init.el ends here
#+end_src

* Init
#+name: init-header-block
#+begin_src emacs-lisp :exports none
;;; init.el --- deftpunk Emacs config file -*- lexical-binding: t; buffer-read-only: t -*-
;;;
;;; Commentary:
;;; Emacs `init.el' config for deftpunk
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/deftpunk-emacs.org
;;;
;;; Code:
#+end_src

** Set some deftpunk variables

=etc/= - For files & directories that we save across systems, e.g. dictionaries, abbreviations
=var/= - For files & directories that are local, e.g. caches, backups

#+begin_src emacs-lisp :name globals

  (defconst deftpunk--emacs-dir (file-truename "~/.emacs.d")
    "The path to the emacs.d directory")

  (defconst deftpunk--org-configuration-file (concat deftpunk--emacs-dir "/deftpunk-emacs.org")
    "The Org mode literate configuration file.")

  (defconst deftpunk--etc-dir (concat deftpunk--emacs-dir "/etc/")
    "Location for files to save across systems.")

  (defconst deftpunk--var-dir (concat deftpunk--emacs-dir "/var/")
    "Location for cache & files that we don't save across systems.")

  ;; I use Mac & occasionally Linux, no Windoze.
  (defconst IS-MAC (eq system-type 'darwin))
  (defconst IS-LINUX (eq system-type 'gnu/linux))
#+end_src

** Package Management

Starting to use elpaca with =use-package= instead of straight for package management.

