init.el
;;; init.el --- deftpunk Emacs config file -*- lexical-binding: t; buffer-read-only: t -*-
;;;
;;; Commentary:
;;; Emacs `init.el' config for deftpunk
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/deftpunk-emacs.org
;;;
;;; Code:

(defconst deftpunk--emacs-dir (file-truename "~/.emacs.d")
  "The path to the emacs.d directory")

(defconst deftpunk--org-configuration-file (concat deftpunk--emacs-dir "/deftpunk-emacs.org")
  "The Org mode literate configuration file.")

(defconst deftpunk--etc-dir (concat deftpunk--emacs-dir "/etc/")
  "Location for files to save across systems.")

(defconst deftpunk--var-dir (concat deftpunk--emacs-dir "/var/")
  "Location for cache & files that we don't save across systems.")

;; I use Mac & occasionally Linux, no Windoze.
(defconst IS-MAC (eq system-type 'darwin))
(defconst IS-LINUX (eq system-type 'gnu/linux))
