dftpnk-emacs.org
*** [[https://github.com/progfolio/elpaca][elpaca]]

#+begin_src emacs-lisp :name elpaca
  (defvar elpaca-installer-version 0.6)
  (defvar elpaca-directory (expand-file-name "elpaca/" deftpunk--var-dir))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install a package via the elpaca macro
  ;; See the "recipes" section of the manual for more details.

  ;; (elpaca example-package)

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable :elpaca use-package keyword.
    (elpaca-use-package-mode)
    ;; Assume :elpaca t unless otherwise specified.
    (setq elpaca-use-package-by-default t))

  ;; Block until current queue processed.
  (elpaca-wait)

  ;;When installing a package which modifies a form used at the top-level
  ;;(e.g. a package which adds a use-package key word),
  ;;use `elpaca-wait' to block until that package has been installed/configured.
  ;;For example:
  ;;(use-package general :demand t)
  ;;(elpaca-wait)

  ;; Expands to: (elpaca evil (use-package evil :demand t))
  ;; (use-package evil :demand t)

  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause the declaration to be interpreted immediately (not deferred).
  ;;Useful for configuring built-in emacs features.
  ;; (use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

  ;; Don't install anything. Defer execution of BODY
  ;; (elpaca nil (message "deferred"))
#+end_src

*** [[https://github.com/noctuid/general.el][General]]

Better manage some keybindings.

#+begin_src emacs-lisp :name general.el
  (use-package general)

  (elpaca-wait)

  ;; local leader
  ;; This allows for finer granularity than hydra-major-mode by binding to individual key maps.
  (general-create-definer deftpunk-local-leader-def
    :keymaps 'override
    :prefix "C-;")
#+end_src

*** [[https://github.com/radian-software/blackout][Blackout]]

Clean up the modeline.  Adds =:blackout= to =use-package= declarations.

#+begin_src emacs-lisp :name blackout
  (use-package blackout)
  (elpaca-wait)
#+end_src

*** [[https://github.com/ajgrf/on.el][on.el]]

Some utility hooks and functions from Doom Emacs.

Hooks:
=on-first-input= - eg. delay loading which-key-mode until the 1st keys is pressed.
=on-first-file=
=on-first-buffer=
=on-init-ui=
=on-switch-buffer=
=on-switch-frame=
=on-switch-window=

#+begin_src emacs-lisp :name on.el
  (use-package on
    :elpaca (:host github :repo "ajgrf/on.el")
    :config
    (elpaca-wait)
    (require 'on))
#+end_src

*** [[https://github.com/justbur/emacs-which-key][which-key]]

Display keybindings following your prefix command in a popup.

TODO: the which-key-show-toplevel binding doesn't work
(global-set-key (kbd "C-h <BLAH-m>") 'which-key-show-toplevel)
Autoloading file /Users/bodine/MyStuff/dftpunk-emacs/var/elpaca/builds/which-key/which-key.elc failed to define function which-key-show-toplevel

#+begin_src emacs-lisp :name which-key
  (use-package which-key
    :blackout
    :commands (which-key-mode which-key-show-toplevel)
    :hook (on-first-input . which-key-mode)
    :custom
    (which-key-enable-exteded-define-key t)
    (which-key-idle-delay 0.5)
    :config
    (elpaca-wait)
    (which-key-mode +1))
#+end_src

*** [[https://github.com/abo-abo/hydra][hydra]]

Use hydra for repeating keys.

#+begin_src emacs-lisp :name hydra
  (use-package hydra)
  (elpaca-wait)
#+end_src

