dftpnk-emacs.org
** Some useful functions

#+begin_src emacs-lisp :name some-macros-and-functions
  ;;; Some convenience macros from our favorite martian - Doom Emacs creator Henrik Lissner ;;;

  ;; 4/22/2020 - In after! below, I removed the check to see if the package was
  ;; in the list of doom-disabled-packages
  (defmacro after! (package &rest body)
    "Evaluate BODY after PACKAGE have loaded.

      PACKAGE is a symbol or list of them. These are package names, not modes,
      functions or variables. It can be:

      - An unquoted package symbol (the name of a package)
          (after! helm BODY...)
      - An unquoted list of package symbols (i.e. BODY is evaluated once both magit
        and git-gutter have loaded)
          (after! (magit git-gutter) BODY...)
      - An unquoted, nested list of compound package lists, using any combination of
        :or/:any and :and/:all
          (after! (:or package-a package-b ...)  BODY...)
          (after! (:and package-a package-b ...) BODY...)
          (after! (:and package-a (:or package-b package-c) ...) BODY...)
        Without :or/:any/:and/:all, :and/:all are implied.

      This is a wrapper around `eval-after-load' that:

      1. Suppresses warnings for disabled packages at compile-time
      2. No-ops for package that are disabled by the user (via `package!')
      3. Supports compound package statements (see below)
      4. Prevents eager expansion pulling in autoloaded macros all at once"
    (declare (indent defun) (debug t))
    (if (symbolp package)
        (list (if (or (not (bound-and-true-p byte-compile-current-file))
                      (require package nil 'noerror))
                  #'progn
                #'with-no-warnings)
              (let ((body (macroexp-progn body)))
                `(if (featurep ',package)
                     ,body
                   ;; We intentionally avoid `with-eval-after-load' to prevent
                   ;; eager macro expansion from pulling (or failing to pull) in
                   ;; autoloaded macros/packages.
                   (eval-after-load ',package ',body))))
      (let ((p (car package)))
        (cond ((not (keywordp p))
               `(after! (:and ,@package) ,@body))
              ((memq p '(:or :any))
               (macroexp-progn
                (cl-loop for next in (cdr package)
                         collect `(after! ,next ,@body))))
              ((memq p '(:and :all))
               (dolist (next (cdr package))
                 (setq body `((after! ,next ,@body))))
               (car body))))))

  (defmacro appendq! (sym &rest lists)
    "Append LISTS to SYM in place."
    `(setq ,sym (append ,sym ,@lists)))

  ;; TODO: Need the doom-enlist function definition for this to work.
  ;;  (defmacro defadvice! (symbol arglist &optional docstring &rest body)
  ;;    "Define an advice called SYMBOL and add it to PLACES.
  ;;
  ;;    ARGLIST is as in `defun'. WHERE is a keyword as passed to `advice-add', and
  ;;    PLACE is the function to which to add the advice, like in `advice-add'.
  ;;    DOCSTRING and BODY are as in `defun'.
  ;;
  ;;    \(fn SYMBOL ARGLIST &optional DOCSTRING &rest [WHERE PLACES...] BODY\)"
  ;;    (declare (doc-string 3) (indent defun))
  ;;    (unless (stringp docstring)
  ;;      (push docstring body)
  ;;      (setq docstring nil))
  ;;    (let (where-alist)
  ;;      (while (keywordp (car body))
  ;;        (push `(cons ,(pop body) (doom-enlist ,(pop body)))
  ;;              where-alist))
  ;;      `(progn
  ;;         (defun ,symbol ,arglist ,docstring ,@body)
  ;;         (dolist (targets (list ,@(nreverse where-alist)))
  ;;           (dolist (target (cdr targets))
  ;;             (advice-add target (car targets) #',symbol))))))
  ;;
  ;;  (defmacro delq! (elt list &optional fetcher)
  ;;    "`delq' ELT from LIST in-place.
  ;;      If FETCHER is a function, ELT is used as the key in LIST (an alist)."
  ;;    `(setq ,list
  ;;           (delq ,(if fetcher
  ;;                      `(funcall ,fetcher ,elt ,list)
  ;;                    elt)
  ;;                 ,list)))

  ;; There are certain buffers I don't want to delete on accident.
  ;; Code taken from https://github.com/rememberYou/.emacs.d/blob/master/config.org
  (defvar *protected-buffers* '("*scratch*" "*Messages*"))

  (defun arco/protected-buffers ()
    "Protects some buffers from being killed."
    (dolist (buffer *protected-buffers*)
      (if (get-buffer buffer)
          (with-current-buffer buffer
            (emacs-lock-mode 'kill))
        (get-buffer-create buffer)
        (with-current-buffer buffer
          (emacs-lock-mode 'kill)))))

  (general-add-hook 'emacs-startup-hook #'arco/protected-buffers)

    ;;;###autoload
  ;; https://stackoverflow.com/questions/251908/how-can-i-insert-current-date-and-time-into-a-file-using-emacs
  (defun today ()
    "Insert string for today's date nicely formatted in American style,
    e.g. Sunday, September 17, 2000."
    (interactive)                 ; permit invocation in minibuffer
    (insert (format-time-string "%A, %B %e, %Y")))

    ;;;###autoload
  (defun flex//kill-current-buffer ()
    "What it says."
    (interactive)
    (kill-buffer (current-buffer)))

  (defun vim-return ()
    "Still want Return to do the right thing in dired mode."
    (interactive)
    (if (eq major-mode 'dired-mode)
        (dired-find-file)
      (progn
        (next-line)
        (back-to-indentation-or-beginning))))

  ;; not broken, toggle letter case from
  ;; http://ergoemacs.org/emacs/modernization_upcase-word.html][xah]] originally.
  ;; http://stackoverflow.com/questions/18257573/how-to-toggle-letter-cases-in-a-region-in-emacs
  (defun toggle-letter-case ()
    "Toggle the letter case of current word or text selection.
     Toggles between: “all lower”, “Init Caps”, “ALL CAPS”."
    (interactive)
    (let (p1 p2 (deactivate-mark nil) (case-fold-search nil))
      (if (region-active-p)
          (setq p1 (region-beginning) p2 (region-end))
        (let ((bds (bounds-of-thing-at-point 'word) ) )
          (setq p1 (car bds) p2 (cdr bds)) ) )
      (when (not (eq last-command this-command))
        (save-excursion
          (goto-char p1)
          (cond
           ((looking-at "[[:lower:]][[:lower:]]") (put this-command 'state "all lower"))
           ((looking-at "[[:upper:]][[:upper:]]") (put this-command 'state "all caps") )
           ((looking-at "[[:upper:]][[:lower:]]") (put this-command 'state "init caps") )
           ((looking-at "[[:lower:]]") (put this-command 'state "all lower"))
           ((looking-at "[[:upper:]]") (put this-command 'state "all caps") )
           (t (put this-command 'state "all lower") ) ) ) )
      (cond
       ((string= "all lower" (get this-command 'state))
        (upcase-initials-region p1 p2) (put this-command 'state "init caps"))
       ((string= "init caps" (get this-command 'state))
        (upcase-region p1 p2) (put this-command 'state "all caps"))
       ((string= "all caps" (get this-command 'state))
        (downcase-region p1 p2) (put this-command 'state "all lower")) )
      ) )

  ;;
  (defun deftpunk/catch-error-p (func-symbol)
    "Call the passed function solely for the purpose of catching its error."
    (let (retval)
      (condition-case error
          (funcall func-symbol)
        ('error (setq retval error)))
      retval))

  ;; Full history of this function is foggy and lost to time.
  ;; https://stackoverflow.com/questions/234963/re-open-scratch-buffer-in-emacs
  (defun eme-goto-scratch ()
              "this sends you to the scratch buffer"
              (interactive)
              (let ((eme-scratch-buffer (get-buffer-create "*scratch*")))
      (switch-to-buffer eme-scratch-buffer)
      (lisp-interaction-mode)))

  ;; Some more excellence from karthinks.
  (defun repeated-prefix-help-command ()
    (interactive)
    (when-let* ((keys (this-command-keys-vector))
                (prefix (seq-take keys (1- (length keys))))
                (orig-keymap (key-binding prefix 'accept-default))
                (keymap (copy-keymap orig-keymap))
                (exit-func (set-transient-map keymap t #'which-key-abort)))
      (define-key keymap [remap keyboard-quit]
                  (lambda () (interactive) (funcall exit-func)))
      (which-key--create-buffer-and-show nil keymap)))
  (setq prefix-help-command #'repeated-prefix-help-command)
#+end_src

