dftpnk-emacs.org
** Some initial packages and libraries
*** [[https://github.com/emacscollective/no-littering][no-littering]]

Helping keep my ~/.emacs.d clean.

#+begin_src emacs-lisp :name no-littering
  (use-package no-littering
    :custom
    (no-littering-etc-directory deftpunk--etc-dir)
    (no-littering-var-directory deftpunk--var-dir)
    (auto-save-file-name-transforms
     `((".*" ,(expand-file-name "auto-save/" no-littering-var-directory) t))))

  (elpaca-wait) ; So that other packages know where some Emacs system files are.
#+end_src

*** [[https://github.com/bbatsov/crux][crux]]

Some useful interactive commands from bbatsov

#+begin_src emacs-lisp :name crux
  (use-package crux
    :bind (("C-a" . crux-move-beginning-of-line)
           ("C-k" . crux-smart-kill-line)
           ("s-o" . crux-smart-open-line-above)
           ("s-RET" . crux-smart-open-line)))
#+end_src

** Appearance
*** Fonts

A million ways to set fonts in Emacs - we will deal with mixed & variable pitch later.
http://idiocy.org/emacs-fonts-and-fontsets.html
https://archive.casouri.cc/note/2021/fontset/index.html

2023-01-21 - This didn't work when it was in early-init.el

#+begin_src emacs-lisp :name Fonts
  (set-face-attribute 'default nil :font "Menlo" :height 120)
  ;;(set-face-attribute 'default nil :font "Victor Mono" :height 110)
  (set-fontset-font t nil "Menlo" nil 'append) ; fallback font
#+end_src

*** [[https://github.com/domtronn/all-the-icons.el][all-the-icons]]

Make the icons in Emacs pretty. Don't forget to run =M-x all-the-icons-install-fonts= if this is a new install.

#+begin_src emacs-lisp :name all_the_icons
  (use-package all-the-icons)
#+end_src
**** [[https://github.com/jtbm37/all-the-icons-dired][all-the-icons-dired]]

Add some =all-the-icons= to dired.

#+begin_src emacs-lisp :name all-the-icons-dired
  (use-package all-the-icons-dired
    :config
    :hook (dired-mode . (lambda ()
                          (interactive)
                          (unless (file-remote-p default-directory)
                            (all-the-icons-dired-mode)))))
#+end_src

*** [[https://github.com/Malabarba/beacon][beacon]]

Try not to lose the cursor on moving.

#+begin_src emacs-lisp :name beacon
  (use-package beacon
    :custom
    (beacon-lighter "")
    (beacon-size 45)
    :config
    (beacon-mode 1))
#+end_src

*** [[https://github.com/tarsius/hl-todo][hl-todo]]

Highlight TODO and similar keywords in comments and strings.

By default it is only active in modes that derive from prog-mode.

Integrations:
- =magit-hl-todos=
- =consult-todos=

This package also provides commands for moving to the next or previous keyword,
to invoke occur with a regexp that matches all known keywords, and to insert a keyword.
If you want to use these commands, then you should bind them in hl-todo-mode-map, e.g.:

(define-key hl-todo-mode-map (kbd "C-c p") 'hl-todo-previous)
(define-key hl-todo-mode-map (kbd "C-c n") 'hl-todo-next)
(define-key hl-todo-mode-map (kbd "C-c o") 'hl-todo-occur)
(define-key hl-todo-mode-map (kbd "C-c i") 'hl-todo-insert)

#+begin_src emacs-lisp :name hl-todo
  (use-package hl-todo
    :elpaca (hl-todo :depth nil) ; see https://github.com/alphapapa/magit-todos/issues/171
    :init
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces '(("TODO" . "#FF0000")
                                  ("FIXME" . "#FF9999")
                                  ("FAIL" . "#FF0000")
                                  ("DEPRECATED" . "#1F39EF")
                                  ("HACK" . "#FF0000")
                                  ("XXX" . "#FF0000")
                                  ("NOTE" . "#1E90FF")))
    :hook (prog-mode . hl-todo-mode))
#+end_src

*** [[https://github.com/hlissner/emacs-solaire-mode][solaire-mode]]

Help visually distinguish buffers. If you don't like the lighter/darker arrangement you can change it with =(add-to-list 'solaire-mode-themes-to-face-swap 'doom-vibrant)=

Supported themes:
- Doom themes
- nano-theme
- modus-themes
- parchment
- spacemacs-theme
- vscode-dark-plus-theme
- wilmersdorf-theme

#+begin_src emacs-lisp :name solaire-mode
  (use-package solaire-mode
    :config
    (solaire-global-mode +1))
#+end_src

*** Themes

**** [[https://github.com/catppuccin/emacs][catppuccin]]

#+begin_src emacs-lisp :name catppuccin
  (use-package catppuccin-theme
    :config
    (load-theme 'catppuccin :no-confirm)
    (setq catppquccin-flavor 'mocha) ;; or 'latte, 'macchiato, or 'mocha
    (catppuccin-reload))
#+end_src

*** Doom modeline

#+begin_src emacs-lisp :name doom-modeline
  (use-package doom-modeline
    :custom
    (doom-modeline-buffer-file-name-style 'truncate-upto-root)
    (doom-modeline-buffer-name t)
    (doom-modeline-vcs-max-length 35)
    (doom-modeline-icon t)
    :init
    (doom-modeline-mode 1)
    :config
    (setq inhibit-compacting-font-caches t) ;; Don´t compact font caches during GC

    (unless (eq system-type 'darwin)
      (if (facep 'mode-line-active)
          (set-face-attribute 'mode-line-active nil
                              :family "Hack"
                              :height 100) ; For 29+
        (set-face-attribute 'mode-line nil
                            :family "Hack"
                            :height 100))
      (set-face-attribute 'mode-line-inactive nil
                          :family "Hack"
                          :height 100))

    (when (eq system-type 'darwin)
      (if (facep 'mode-line-active)
          (set-face-attribute 'mode-line-active nil
                              :family "Hack Nerd Font"
                              :height 130) ; For 29+
        (set-face-attribute 'mode-line nil
                            :family "Hack Nerd Font"
                            :height 130))
      (set-face-attribute 'mode-line-inactive nil
                          :family "Hack Nerd Font"
                          :height 130)))
#+end_src

** Completion Frameworks

*** Some minibuffer mappings first

Some info on minibuffer mappings:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Minibuffer-Maps.html

#+begin_src emacs-lisp :name minibuffer-mappings

  (keymap-set minibuffer-local-map "C-w" 'backword-kill-word)
  (keymap-set minibuffer-local-completion-map "C-w" 'backword-kill-word)
  (keymap-set minibuffer-local-filename-completion-map "C-w" 'backword-kill-word)
#+end_src

*** [[https://github.com/abo-abo/avy][avy]]

Jump to things in Emacs tree-style

#+begin_src emacs-lisp :name avy
  (use-package avy
    :defer t
    :config
    (setq avy-all-windows nil
          avy-background t))
#+end_src

*** [[https://github.com/minad/vertico][vertico]]

Vertical completion UI based on the default completion system.

#+begin_src emacs-lisp :name vertico
  (use-package vertico
    :demand t ; otherwise it doesn't come up right away.
    :elpaca (vertico :files (:defaults "extensions/*") ; Special recipe to load extensions conveniently
             :includes (vertico-indexed
                        vertico-flat
                        vertico-grid
                        vertico-mouse
                        vertico-quick
                        vertico-buffer
                        vertico-repeat
                        vertico-reverse
                        vertico-directory
                        vertico-multiform
                        vertico-unobtrusive
                        ))
    :general
    (:keymaps 'vertico-map
          "<tab>" #'vertico-insert
          "<escape>" #'keyboard-quit
          "<backspace>" #'vertico-directory-delete-char
          "C-w" #'vertico-directory-delete-word
          "?" #'minibuffer-completion-help
          "s-." #'vertico-repeat
          )
    :custom
    (read-file-name-completion-ignore-case t)
    (read-buffer-completion-ignore-case t)
    (completion-ignore-case t)
    (vertico-resize t)
    (vertico-cycle t)
    (vertico-count 25)
    :config
    (vertico-mode))
#+end_src

*** [[https://github.com/oantolin/orderless][orderless]]

Provides an =orderless= completion style - a more advanced completion style.

#+begin_src emacs-lisp :name orderless
  (use-package orderless
    :after vertico
    :custom
    (orderless-matching-styles
     '(orderless-literal
       orderless-prefixes
       orderless-initialism
       orderless-regexp
       orderless-flex))
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides
     '((file (styles basic-remote                            ; basic-remote for Tramp hostname completion with vertico
                     orderless partial-completion)))))
#+end_src

*** [[https://github.com/minad/marginalia][Marginalia]]

Add marginalia to minibuffer completions - annotations in the minibuffer.

#+begin_src emacs-lisp :name marginalia
  (use-package marginalia
    :general
    (:keymaps 'minibuffer-local-map
     "s-a" 'marginalia-cycle)
    :custom
    (marginalia-max-relative-age 0)
    (marginalia-align 'right)
    :init
    (marginalia-mode)
    :config
    ;; An annotator so that M-x aliases show up.
    ;; https://www.reddit.com/r/emacs/comments/196pvtx/comment/khxa8ip/?utm_source=share&utm_medium=web2x&context=3
    (defun marginalia-annotate-alias (cand)
  "Annotate CAND with the function it aliases."
  (when-let ((sym (intern-soft cand))
         (alias (car (last (function-alias-p sym t))))
         (name (and (symbolp alias) (symbol-name alias))))
    (format #(" (%s)" 1 5 (face marginalia-function)) name)))

    (defun marginalia-annotate-command-with-alias (cand)
  "Annotate command CAND with its documentation string.
    Similar to `marginalia-annotate-symbol', but does not show symbol class."
  (when-let (sym (intern-soft cand))
    (concat
     (marginalia-annotate-binding cand)
     (marginalia-annotate-alias cand)
     (marginalia--documentation (marginalia--function-doc sym)))))

    (cl-pushnew #'marginalia-annotate-command-with-alias
        (alist-get 'command marginalia-annotator-registry)))
#+end_src

*** [[https://github.com/iyefrat/all-the-icons-completion][all-the-icons-completion]]

Add icons to completion candidates.

#+begin_src emacs-lisp :name all-the-icons-completion
  (use-package all-the-icons-completion
    :after (marginalia all-the-icons)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
    :init
    (all-the-icons-completion-mode))
#+end_src

