init.el

(use-package no-littering
  :custom
  (no-littering-etc-directory deftpunk--etc-dir)
  (no-littering-var-directory deftpunk--var-dir)
  (auto-save-file-name-transforms
   `((".*" ,(expand-file-name "auto-save/" no-littering-var-directory) t))))

(elpaca-wait) ; So that other packages know where some Emacs system files are.

(use-package crux
  :bind (("C-a" . crux-move-beginning-of-line)
         ("C-k" . crux-smart-kill-line)
         ("s-o" . crux-smart-open-line-above)
         ("s-RET" . crux-smart-open-line)))

(set-face-attribute 'default nil :font "Menlo" :height 120)
;;(set-face-attribute 'default nil :font "Victor Mono" :height 110)
(set-fontset-font t nil "Menlo" nil 'append) ; fallback font

(use-package all-the-icons)

(use-package beacon
  :custom
  (beacon-lighter "")
  (beacon-size 45)
  (beacon-blink-when-window-scrolls nil)
  :config (beacon-mode 1))

(use-package hl-todo
  :elpaca (hl-todo :depth nil) ; see https://github.com/alphapapa/magit-todos/issues/171
  :init
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces '(("TODO" . "#FF0000")
                                ("FIXME" . "#FF9999")
                                ("FAIL" . "#FF0000")
                                ("DEPRECATED" . "#1F39EF")
                                ("HACK" . "#FF0000")
                                ("XXX" . "#FF0000")
                                ("NOTE" . "#1E90FF")))
  :hook (prog-mode . hl-todo-mode))

(use-package solaire-mode
  :config
  (solaire-global-mode +1))

(keymap-set minibuffer-local-map "C-w" 'backword-kill-word)
(keymap-set minibuffer-local-completion-map "C-w" 'backword-kill-word)
(keymap-set minibuffer-local-filename-completion-map "C-w" 'backword-kill-word)

(use-package avy
  :defer t
  :config
  (setq avy-all-windows nil
        avy-background t))

(use-package vertico
  :demand t ; otherwise it doesn't come up right away.
  :elpaca (vertico :files (:defaults "extensions/*") ; Special recipe to load extensions conveniently
           :includes (vertico-indexed
                      vertico-flat
                      vertico-grid
                      vertico-mouse
                      vertico-quick
                      vertico-buffer
                      vertico-repeat
                      vertico-reverse
                      vertico-directory
                      vertico-multiform
                      vertico-unobtrusive
                      ))
  :general
  (:keymaps 'vertico-map
        "<tab>" #'vertico-insert
        "<escape>" #'keyboard-quit
        "<backspace>" #'vertico-directory-delete-char
        "C-w" #'vertico-directory-delete-word
        "?" #'minibuffer-completion-help
        "s-." #'vertico-repeat
        )
  :custom
  (read-file-name-completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  (completion-ignore-case t)
  (vertico-resize t)
  (vertico-cycle t)
  (vertico-count 25)
  :config
  (vertico-mode))

(use-package orderless
  :after vertico
  :custom
  (orderless-matching-styles
   '(orderless-literal
     orderless-prefixes
     orderless-initialism
     orderless-regexp
     orderless-flex))
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides
   '((file (styles basic-remote                            ; basic-remote for Tramp hostname completion with vertico
                   orderless partial-completion)))))

(use-package marginalia
  :general
  (:keymaps 'minibuffer-local-map
   "s-a" 'marginalia-cycle)
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  :init
  (marginalia-mode)
  :config
  ;; An annotator so that M-x aliases show up.
  ;; https://www.reddit.com/r/emacs/comments/196pvtx/comment/khxa8ip/?utm_source=share&utm_medium=web2x&context=3
  (defun marginalia-annotate-alias (cand)
"Annotate CAND with the function it aliases."
(when-let ((sym (intern-soft cand))
       (alias (car (last (function-alias-p sym t))))
       (name (and (symbolp alias) (symbol-name alias))))
  (format #(" (%s)" 1 5 (face marginalia-function)) name)))

  (defun marginalia-annotate-command-with-alias (cand)
"Annotate command CAND with its documentation string.
  Similar to `marginalia-annotate-symbol', but does not show symbol class."
(when-let (sym (intern-soft cand))
  (concat
   (marginalia-annotate-binding cand)
   (marginalia-annotate-alias cand)
   (marginalia--documentation (marginalia--function-doc sym)))))

  (cl-pushnew #'marginalia-annotate-command-with-alias
      (alist-get 'command marginalia-annotator-registry)))

(use-package all-the-icons-completion
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))

(use-package consult
