dftpnk-emacs.org
*** [[https://github.com/minad/consult][consult]]

Search and navigation commands based on the Emacs completion function

#+begin_src emacs-lisp :name consult
  (use-package consult
    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :bind (("C-c r" . consult-ripgrep)
           ([remap switch-to-buffer] . consult-buffer)
           ("s-i" . consult-buffer)
           :map minibuffer-local-map
           ("s-s" . consult-history)
           ("C-r" . consult-history))
    :custom
    (completion-in-region-function #'consult-completion-in-region))

  ;; from the consult wiki
  (defcustom my/consult-ripgrep-or-line-limit 300000
    "Buffer size threshold for `my/consult-ripgrep-or-line'.
  When the number of characters in a buffer exceeds this threshold,
  `consult-ripgrep' will be used instead of `consult-line'."
    :type 'integer)

  (defun my/consult-ripgrep-or-line ()
    "Call `consult-line' for small buffers or `consult-ripgrep' for large files."
    (interactive)
    (if (or (not buffer-file-name)
            (buffer-narrowed-p)
            (ignore-errors
              (file-remote-p buffer-file-name))
            (jka-compr-get-compression-info buffer-file-name)
            (<= (buffer-size)
                (/ my/consult-ripgrep-or-line-limit
                   (if (eq major-mode 'org-mode) 4 1))))
        (consult-line)
      (when (file-writable-p buffer-file-name)
        (save-buffer))
      (let ((consult-ripgrep-args
             (concat consult-ripgrep-args
                     ;; filter to desired filename
                     " -g "
                     (shell-quote-argument (file-name-nondirectory buffer-file-name))
                     " ")))
        (consult-ripgrep))))
#+end_src

**** [[https://github.com/karthink/consult-dir][consult-dir]]

Call *consult-dir* when in the minibuffer to choose a directory with completion and insert it into the
minibuffer prompt, shadowing or replacing the directory path showing currently. The file name part
of the text is retained. This lets the user switch to distant directories very quickly when finding
files, for instance.

Call *consult-dir* from a regular buffer to choose a directory with completion and then interactively
find a file in that directory. The command run with this directory is configurable via
consult-dir-default-command and defaults to find-file.

Call *consult-dir-jump-file* from the minibuffer to asynchronously find a file anywhere under the
directory that is currently in the prompt. This can be used with consult-dir to quickly switch
directories and find files at an arbitrary depth under them. consult-dir-jump-file uses consult-find
under the hood.

Replace minibuffer-local-completion-map above with

- vertico-map if you use Vertico,
- selectrum-minibuffer-map if you use Selectrum.

#+begin_src emacs-lisp :name consult-dir
  (use-package consult-dir
    :ensure t
    :bind (("C-x C-d" . consult-dir)
           :map minibuffer-local-completion-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file)))
#+end_src

**** [[https://github.com/liuyinz/consult-todo][consult-todo]]


#+begin_src emacs-lisp :name consult-todo
  (use-package consult-todo
    :demand t
    :elpaca (:main nil) ; skip dependency check because hl-todos doesn't have version info.
    :custom
    (defconst consult-todo--narrow
    '((?t . "TODO")
      (?f . "FIXME")
      (?d . "DEPRECATED")
      (?b . "BUG")
      (?x . "XXX")
      (?n . "NOTE")
      (?h . "HACK"))
    "Default mapping of narrow and keywords."))
#+end_src

*** embark

#+begin_src emacs-lisp :name embark
  (use-package embark
    :bind
    (("C-c a" . embark-act)))
#+end_src

*** embark-consult

#+begin_src emacs-lisp :name embark-consult
  (use-package embark-consult
    :after (embark consult))
#+end_src

*** cape

#+begin_src emacs-lisp :name cap
  (use-package cape
    :config
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster))
#+end_src

*** [[https://github.com/minad/corfu][corfu]]

In-buffer completion - text completion like =company-mode=

- Any invocation of =completion-at-point= or =completion-in-region= leverages =corfu=.
- Any completion style, e.g. =orderless= can be used for filtering candidates.
- You can use any =company= backend via =cape-company-to-capf=

TODO: Add =company-yasnippet= support.
TODO: Add orderless support

Some config options from here: https://kristofferbalintona.me/posts/202202270056/

#+begin_src emacs-lisp :name corfu
  (use-package corfu
    :elpaca (corfu :files (:defaults "extensions/*")
           :includes (corfu-info corfu-history corfu-popupinfo))
    :general
    (:keymaps 'corfu-map
          :states 'insert
          "C-n" #'corfu-next
          "C-p" #'corfu-previous
          "TAB" #'corfu-next
          "S-TAB" #'corfu-previous
          "<escape>" #'corfu-quit)
    :custom
    (corfu-cycle t)
    (corfu-min-width 80)
    (corfu-max-width corfu-min-width) ; always have the same width
    (corfu-preselect 'prompt)
    (corfu-auto t)
    (corfu-auto-delay 0.25)
    (corfu-auto-prefix 2)
    (corfu-popupinfo-delay 0)
    ;; `nil' means to ignore `corfu-separator' behavior, that is, use the older
    ;; `corfu-quit-at-boundary' = nil behavior. Set this to separator if using
    ;; `corfu-auto' = `t' workflow (in that case, make sure you also set up
    ;; `corfu-separator' and a keybind for `corfu-insert-separator', which my
    ;; configuration already has pre-prepared). Necessary for manual corfu usage with
    ;; orderless, otherwise first component is ignored, unless `corfu-separator'
    ;; is inserted.
    (corfu-quit-at-boundary nil)
    :init
    (global-corfu-mode)
    (corfu-popupinfo-mode))


#+end_src

*** [[https://github.com/jdtsmith/kind-icon][kind-icon]]

Add some icons to completion prefixes.

#+begin_src emacs-lisp :name kind-icon
  (use-package kind-icon
    :after corfu
    :custom
    (kind-icon-use-icons t)
    ;; No pollution. Change the location of the svg-lib cache directory.
    (svg-lib-icons-dir (no-littering-expand-var-file-name "svg-lib/cache"))
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

