init.el
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :bind (("C-c r" . consult-ripgrep)
         ([remap switch-to-buffer] . consult-buffer)
         ("s-i" . consult-buffer)
         :map minibuffer-local-map
         ("s-s" . consult-history)
         ("C-r" . consult-history))
  :custom
  (completion-in-region-function #'consult-completion-in-region))

;; from the consult wiki
(defcustom my/consult-ripgrep-or-line-limit 300000
  "Buffer size threshold for `my/consult-ripgrep-or-line'.
When the number of characters in a buffer exceeds this threshold,
`consult-ripgrep' will be used instead of `consult-line'."
  :type 'integer)

(defun my/consult-ripgrep-or-line ()
  "Call `consult-line' for small buffers or `consult-ripgrep' for large files."
  (interactive)
  (if (or (not buffer-file-name)
          (buffer-narrowed-p)
          (ignore-errors
            (file-remote-p buffer-file-name))
          (jka-compr-get-compression-info buffer-file-name)
          (<= (buffer-size)
              (/ my/consult-ripgrep-or-line-limit
                 (if (eq major-mode 'org-mode) 4 1))))
      (consult-line)
    (when (file-writable-p buffer-file-name)
      (save-buffer))
    (let ((consult-ripgrep-args
           (concat consult-ripgrep-args
                   ;; filter to desired filename
                   " -g "
                   (shell-quote-argument (file-name-nondirectory buffer-file-name))
                   " ")))
      (consult-ripgrep))))

(use-package consult-dir
  :ensure t
  :bind (("C-x C-d" . consult-dir)
         :map minibuffer-local-completion-map
         ("C-x C-d" . consult-dir)
         ("C-x C-j" . consult-dir-jump-file)))

(use-package consult-todo
  :demand t
  :elpaca (:main nil) ; skip dependency check because hl-todos doesn't have version info.
  :custom
  (defconst consult-todo--narrow
  '((?t . "TODO")
    (?f . "FIXME")
    (?d . "DEPRECATED")
    (?b . "BUG")
    (?x . "XXX")
    (?n . "NOTE")
    (?h . "HACK"))
  "Default mapping of narrow and keywords."))

(use-package embark
  :bind
  (("C-c a" . embark-act)))

(use-package embark-consult
  :after (embark consult))

(use-package corfu
  :elpaca (corfu :files (:defaults "extensions/*")
         :includes (corfu-info corfu-history))
  :general
  (:keymaps 'corfu-map
        :states 'insert
        "C-n" #'corfu-next
        "C-p" #'corfu-previous
        "TAB" #'corfu-next
        "S-TAB" #'corfu-previous
        "<escape>" #'corfu-quit)
  :custom
  (corfu-cycle t)
  (corfu-min-width 80)
  (corfu-max-width corfu-min-width) ; always have the same width
  (corfu-preselect 'prompt)
  (corfu-auto t)
  (corfu-auto-delay 0.25)
  (corfu-auto-prefix 2)
  (corfu-popupinfo-delay 0)
  ;; `nil' means to ignore `corfu-separator' behavior, that is, use the older
  ;; `corfu-quit-at-boundary' = nil behavior. Set this to separator if using
  ;; `corfu-auto' = `t' workflow (in that case, make sure you also set up
  ;; `corfu-separator' and a keybind for `corfu-insert-separator', which my
  ;; configuration already has pre-prepared). Necessary for manual corfu usage with
  ;; orderless, otherwise first component is ignored, unless `corfu-separator'
  ;; is inserted.
  (corfu-quit-at-boundary nil)
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode))

(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-use-icons t)
  ;; No pollution. Change the location of the svg-lib cache directory.
  (svg-lib-icons-dir (no-littering-expand-var-file-name "svg-lib/cache"))
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(setq-default
