dftpnk-emacs.org
** Emacs Defaults
#+begin_src emacs-lisp :name defaults
  (setq-default
   display-time-default-load-average nil            ; Don't display load average
   fill-column 100                                  ; Set column width
   help-window-select t                             ; Focus new help windows when opened
   indent-tabs-mode nil                             ; Prefer spaces over tabs, duh.
   tab-width 4                                      ; Set width for tabs
   kill-ring-max 128                                ; Maximum length of kill ring
   load-prefer-newer t                              ; Prefer the newest version of a file
   mark-ring-max 128                                ; Maximum length of mark ring
   select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
   x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)
   user-full-name "ERick BOdine"                    ; Name
   vc-follow-symlinks t                             ; Always follow the symlinks
   frame-title-format '("Emacs: %f")                ; Frame title
   icon-title-format frame-title-format             ; OS icon title
   message-log-max 8192                             ; Don't lose any logging information.
   bidi-paragraph-separate-re "^"
   bidi-paragraph-start-re "^"
   ring-bell-function 'ignore                       ; Turn off the damn bell!
   history-delete-duplicates t                      ; Remove dups from helm-M-x & such.
   history-length 55                                ; Limit history length; see above.
   view-read-only t)                                ; Always open read-only buffers in view-mode

  ;; sane trackpad/mouse scroll settings
  (when IS-MAC
    (setq mac-redisplay-dont-reset-vscroll t
          mac-mouse-wheel-smooth-scroll nil))

  ;; Some IO related settings.
  ;; support reading large blobs of data
  (setq process-adaptive-read-buffering nil
        read-process-output-max (* 2048 2048))

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; More performant rapid scrolling over unfontified regions. May cause brief
  ;; spells of inaccurate syntax highlighting right after scrolling, which should
  ;; quickly self-correct.
  (setq fast-but-imprecise-scrolling t)
  (setq-default scroll-conservatively 101)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we halve startup times, particularly when we use
  ;; fonts that are larger than the system default (which would resize the frame).
  (setq frame-inhibit-implied-resize t)

  ;; Don't popup UI/graphical dialog boxes.
  (setq use-dialog-box nil)

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether it has a noteable affect on Linux and Mac hasn't
  ;; been determined, but we inhibit it there anyway.
  (setq inhibit-compacting-font-caches t)

  ;; Remove command line options that aren't relevant to our current OS; means
  ;; slightly less to process at startup.
  (unless IS-MAC   (setq command-line-ns-option-alist nil))
  (unless IS-LINUX (setq command-line-x-option-alist nil))

  ;; Make apropos more useful
  (setq apropos-do-all t)

  ;; Silence advised functions warnings
  (setq ad-redefinition-action 'accept)

  ;; Don't pass over `auto-mode-alist' a second time.
  (setq auto-mode-case-fold nil)

  ;; don't ask to kill buffers
  (setq kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))

  ;; Get rid of "For information about GNU Emacs..." message at startup
  (unless noninteractive
    (advice-add #'display-startup-echo-area-message :override #'ignore)
    (setq inhibit-startup-message t
          inhibit-startup-echo-area-message user-login-name
          inhibit-default-init t
          ;; initial-major-mode 'fundamental-mode
          initial-scratch-message "Welcome to the Church of Emacs, Cardinal deftpunk presiding"
          mode-line-format nil))
  ;; we're in a daemon session, where it'll say "Starting Emacs daemon." instead
  (unless (daemonp)
    (advice-add #'display-startup-echo-area-message :override #'ignore))

  ;; This file stores usernames, passwords, and such.
  (setq auth-sources (list (expand-file-name "authinfo.gpg" deftpunk--etc-dir) "~/.authinfo.gpg"))

  ;; Some timezone stuff for logview.el and others.
  (setenv "TZ" "America/Denver")
  (setq datetime-timezone "America/Denver")

  ;; I actually find the custom system a nuisance; move the file out of the way.
  (setq custom-file (expand-file-name "custom.el" deftpunk--etc-dir))

  ;; Replace yes/no prompts with y/n
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; see https://www.emacswiki.org/emacs/BrowseUrl#h5o-7
  (after! browse-url
    (setq browse-url-browser-function 'browse-url-chrome
          browse-url-chrome-program "/Applications/Google Chrome.app/Contents/MacOS/Google Chrome"
          browse-url-new-window-flag  t))

  ;; Don't ask if you want to kill a buffer with a live process attached to it:
  (remove-hook 'kill-buffer-query-functions 'process-kill-buffer-query-function)

  (after! simple
          ;; The following may be of interest to people who (a) are happy with
          ;; "C-w" and friends for killing and yanking, (b) use
          ;; "transient-mark-mode", (c) also like the traditional Unix tty
          ;; behaviour that "C-w" deletes a word backwards. It tweaks "C-w" so
          ;; that, if the mark is inactive, it deletes a word backwards instead
          ;; of killing the region. Without that tweak, the C-w would create an
          ;; error text without an active region.
          ;; http://www.emacswiki.org/emacs/DefaultKillingAndYanking#toc2

          (defadvice kill-region (before unix-werase activate compile)
            "When called interactively with no active region, delete a single word backwards
             instead."
            (interactive
             (if mark-active (list (region-beginning) (region-end))
               (list (save-excursion (backward-word 1) (point)) (point))))))

  ;; Deleting past a tab normally changes tab into spaces. Don't do
  ;; that, kill the tab instead.
  (setq backward-delete-char-untabify-method nil)

  ;; Don't type C-u C-SPC C-u C-SPC to pop 2 marks, now you can do C-u C-SPC C-SPC
  (setq set-mark-command-repeat-pop t)

  ;; Revert buffers when the underlying file has changed.
  (global-auto-revert-mode 1)
  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; no lockfiles
  (setq create-lockfiles nil)
#+end_src

** Emacs builtin modes

*** [[https://www.emacswiki.org/emacs/AbbrevMode][abbreviations]]

The abbreviations file is saved by =no-littering= into our =etc/= directory as =abbrev.el=

#+begin_src emacs-lisp :name abbreviations
  (setq-default save-abbrevs 'silently)

  ;; Turn abbreviations on globally.
  (setq-default abbrev-mode t)
  (blackout 'abbrev-mode)

  ;; Read the abbrev file on startup.
  (quietly-read-abbrev-file)
#+end_src

*** auto-revert

#+begin_src emacs-lisp :name auto-revert
  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)
  ;; Revert buffers when the underlying file has changed.
  (global-auto-revert-mode 1)
#+end_src

