dftpnk-emacs.org
*** auto-save & backups

Saving and backing up files. While its nice to assume that everything is in source control this is a handy fallback.

#+begin_src emacs-lisp :name auto-save-backup
  ;; https://www.emacswiki.org/emacs/BackupDirectory
  ;; https://stackoverflow.com/questions/151945/how-do-i-control-how-emacs-makes-backup-files

  ;; Default and per-save backups go here:
  (setq backup-directory-alist '(("" . (expand-file-name "backups" deftpunk--var-dir))))

  (defun force-backup-of-buffer ()
    ;; Make a special "per session" backup at the first save of each
    ;; emacs session.
    (when (not buffer-backed-up)
      ;; Override the default parameters for per-session backups.
      (let ((backup-directory-alist '(("" . "~/.emacs.d/backup/per-session")))
            (kept-new-versions 3))
        (backup-buffer)))
    ;; Make a "per save" backup on each save.  The first save results in
    ;; both a per-session and a per-save backup, to keep the numbering
    ;; of per-save backups consistent.
    (let ((buffer-backed-up nil))
      (backup-buffer)))

  (add-hook 'before-save-hook  'force-backup-of-buffer)

  (setq version-control t              ; Use version numbers for backup
        kept-new-versions 5            ; Number of newest version to keep around
        kept-old-versions 0            ; Number of oldest versions to keep around
        delete-old-versions t          ; Don't ask to delete older versions
        backup-by-copying t            ; Copy all files, don't rename them - best compromise for safety.
        vc-make-backup-files t         ; Even backup files under version control
        )
#+end_src

*** [[https://www.gnu.org/software/emacs/manual/html_node/efaq/Displaying-the-current-line-or-column.html][column-number-mode]]

#+begin_src emacs-lisp :name column-number-mode
  (column-number-mode 1)
#+end_src

*** Dired

#+begin_src emacs-lisp :name dired
  (use-package dired
    :elpaca nil
    :custom
    ;; Allow dired to delete or copy a dir.
    ;; 02/14/24 17:41:48 - These default to 'top in dired now.
    ;; 'top means ask every time.
    ;; 'always means don't ask.
    (dired-recursive-copies 'top)
    (dired-recursive-deletes 'top)
    :config

    ;; Open marked files in dired
    ;; http://xahlee.info/emacs/emacs/emacs_dired_open_marked.html
    (defun xah-dired-open-marked ()
      "Open marked files in `dired'.
  URL `http://xahlee.info/emacs/emacs/emacs_dired_open_marked.html'
  Version 2019-10-22"
      (interactive)
      (mapc 'find-file (dired-get-marked-files)))

    ;; Make dired open in the same window when using RET or ^
    ;; Make Dired only use a single buffer when visiting a directory.
    ;; http://ergoemacs.org/emacs/emacs_dired_tips.html
    (put 'dired-find-alternate-file 'disabled nil) ; disables warning
    (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file) ; was dired-advertised-find-file
    (define-key dired-mode-map (kbd "^") (lambda ()
                                           (interactive)
                                           (find-alternate-file ".."))))  ; was dired-up-directory
#+end_src

***  [[https://www.emacswiki.org/emacs/RecentFiles][recentf]]

#+begin_src emacs-lisp :name recentf
  (use-package emacs
    :elpaca nil
    :custom
    (recentf-max-saved-items 250)
    (recentf-max-menu-items 15)
        ;; disable recentf-cleanup on Emacs start, because it can cause
        ;; problems with remote files, ie. Tramp files.
    (recentf-save-file "~/.emacs.d/etc/recentf-save.el")
    (recentf-auto-cleanup 'never)
    (recentf-exclude (list "/scp:"
                           "/ssh:"
                           "/sudo:"
                           "/tmp/"
                           "~$"
                           "COMMIT_EDITMSG"))
    :config
    (recentf-mode +1))
#+end_src

*** [[https://www.emacswiki.org/emacs/SaveHist][savehist]]

Save the minibuffer history.

#+begin_src emacs-lisp :name savehist
  (setq savehist-file (expand-file-name "savehist" deftpunk--var-dir)
        history-length 65                                                ; reducing size helps reduce startup cost.
        history-delete-duplicates t
        savehist-save-minibuffer-history t
        savehist-additional-variables '(kill-ring
                                        search-ring
                                        mark-ring
                                        global-mark-ring
                                        regexp-search-ring
                                        extended-command-history
                                        regexp-search-ring))
  (savehist-mode 1)

  ;; Limit some of the items in savehist
  (put 'savehist-minibuffer-history-variables 'history-length 50)
  (put 'org-read-date-history                 'history-length 50)
  (put 'read-expression-history               'history-length 50)
  (put 'org-table-formula-history             'history-length 50)
  (put 'extended-command-history              'history-length 50)
  (put 'ido-file-history                      'history-length 50)
  (put 'helm-M-x-input-history                'history-length 50)
  (put 'minibuffer-history                    'history-length 50)
  (put 'ido-buffer-history                    'history-length 50)
  (put 'buffer-name-history                   'history-length 50)
  (put 'file-name-history                     'history-length 50)
#+end_src
*** [[https://www.emacswiki.org/emacs/SavePlace][saveplace]]

Remembering the last place you visited in a file.

#+begin_src emacs-lisp :name saveplace
  (setq save-place-file (expand-file-name "emacs-places" deftpunk--var-dir)
        save-place-forget-unreadable-files nil  ; Setting to t has the potential to make exiting slow
        )
  (save-place-mode 1)
  (add-hook 'save-place-find-file-hook 'recenter)
  (add-hook 'find-file-hook 'save-place-find-file-hook t)
#+end_src

*** visual-line-mode

Visually wrap lines in Emacs.

#+begin_src emacs-lisp :name visual-line-mode
  (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  (global-visual-line-mode)
  (blackout 'visual-line-mode)
#+end_src

*** winner-mode

Allows you to "undo" and "redo" window configuration changes.

#+begin_src emacs-lisp :name winner-mode
  ;; Ignore all the *<name>* buffers by regex.
  (setq winner-boring-buffers-regexp "^\\*")
  (winner-mode +1)
#+end_src

** Emacs Enhancements
*** [[https://github.com/abo-abo/ace-window][ace-window]]

Selecting a window/frame to switch to

#+begin_src emacs-lisp :name ace-window
  (use-package ace-window
    :bind (("C--" . ace-window))
    :init
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)
          aw-leading-char-style 'path
          aw-background t
          aw-dispatch-always t)
    :config
    (set-face-attribute 'aw-leading-char-face nil :height 4.0))
#+end_src

*** [[https://github.com/abo-abo/ace-link][ace-link]]

Select a link to jump to in Info, help, woman, org or eww modes

#+begin_src emacs-lisp :name ace-link
   (use-package ace-link
     :init (ace-link-setup-default))
#+end_src

*** [[https://github.com/lccambiaghi/vanilla-emacs#dont-close-windows-on-escape][don't-close-windows-on-escape]]

Sometimes ESC kills my window layout. This advice prevents that from happening.
Found here: https://www.lucacambiaghi.com/vanilla-emacs/readme.html#h:8BB05594-D909-4E99-960B-5624F915E664

#+begin_src emacs-lisp :name emacs
  (use-package emacs
    :elpaca nil
    :config
    (defadvice keyboard-escape-quit
        (around keyboard-escape-quit-dont-close-windows activate)
      (let ((buffer-quit-function (lambda () ())))
        ad-do-it)))
#+end_src

*** [[https://github.com/purcell/unfill][unfill]]

Funtions providing the inverse of =fill-paragraph= & =fill-region= .  I most care about =unfill-toggle=

#+begin_src emacs-lisp :name unfill
  (global-unset-key (kbd "M-u"))
  (use-package unfill
    :bind
    (("M-u" . unfill-toggle)))
#+end_src

*** [[https://github.com/casouri/vundo][vundo]]

Vundo (visual undo) displays the undo history as a tree and lets you move in the tree to go back to
previous buffer states.

#+begin_src emacs-lisp :name vundo
  (use-package vundo
    :commands (vundo)
    :elpaca (vundo :type git :host github :repo "casouri/vundo")
    :custom
    ;; Take less on-screen space.
    (vundo-compact-display t)
    :config

    ;; Better contrasting highlight.
    (custom-set-faces
      '(vundo-node ((t (:foreground "#808080"))))
      '(vundo-stem ((t (:foreground "#808080"))))
      '(vundo-highlight ((t (:foreground "#FFFF00")))))

    ;; Use `HJKL` VIM-like motion, also Home/End to jump around.
    (define-key vundo-mode-map (kbd "l") #'vundo-forward)
    (define-key vundo-mode-map (kbd "<right>") #'vundo-forward)
    (define-key vundo-mode-map (kbd "h") #'vundo-backward)
    (define-key vundo-mode-map (kbd "<left>") #'vundo-backward)
    (define-key vundo-mode-map (kbd "j") #'vundo-next)
    (define-key vundo-mode-map (kbd "<down>") #'vundo-next)
    (define-key vundo-mode-map (kbd "k") #'vundo-previous)
    (define-key vundo-mode-map (kbd "<up>") #'vundo-previous)
    (define-key vundo-mode-map (kbd "<home>") #'vundo-stem-root)
    (define-key vundo-mode-map (kbd "<end>") #'vundo-stem-end)
    (define-key vundo-mode-map (kbd "q") #'vundo-quit)
    (define-key vundo-mode-map (kbd "C-g") #'vundo-quit)
    (define-key vundo-mode-map (kbd "RET") #'vundo-confirm)

    (global-define-key (kbd "C-M-u") 'vundo))
#+end_src

*** [[https://github.com/hlissner/ws-butler][ws-butler]]

The Doom Emacs fork of ws-butler.

Unobtrusively trim spaces from the end of a line on save.

#+begin_src emacs-lisp :name ws-butler
  (use-package ws-butler
    :elpaca (ws-butler :type git :host github :repo "hlissner/ws-butler")
    :blackout t
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode))
    :custom
    (ws-butler-keep-whitespace-before-point nil))

  ;; show trailing whitespace
  (setq show-trailing-whitespace t)

  (with-eval-after-load 'ws-butler
    (blackout 'ws-butler-mode))
#+end_src

** Help and documentation enhancements

*** [[https://github.com/astoff/devdocs.el][devdocs]]

#+begin_src emacs-lisp :name devdocs
  (use-package devdocs
    :init
    (setq devdocs-data-dir (expand-file-name "devdocs" user-emacs-directory)))
#+end_src

