init.el

;; https://www.emacswiki.org/emacs/BackupDirectory
;; https://stackoverflow.com/questions/151945/how-do-i-control-how-emacs-makes-backup-files

;; Default and per-save backups go here:
(setq backup-directory-alist '(("" . (expand-file-name "backups" deftpunk--var-dir))))

(defun force-backup-of-buffer ()
  ;; Make a special "per session" backup at the first save of each
  ;; emacs session.
  (when (not buffer-backed-up)
    ;; Override the default parameters for per-session backups.
    (let ((backup-directory-alist '(("" . "~/.emacs.d/backup/per-session")))
          (kept-new-versions 3))
      (backup-buffer)))
  ;; Make a "per save" backup on each save.  The first save results in
  ;; both a per-session and a per-save backup, to keep the numbering
  ;; of per-save backups consistent.
  (let ((buffer-backed-up nil))
    (backup-buffer)))

(add-hook 'before-save-hook  'force-backup-of-buffer)

(setq version-control t              ; Use version numbers for backup
      kept-new-versions 5            ; Number of newest version to keep around
      kept-old-versions 0            ; Number of oldest versions to keep around
      delete-old-versions t          ; Don't ask to delete older versions
      backup-by-copying t            ; Copy all files, don't rename them - best compromise for safety.
      vc-make-backup-files t         ; Even backup files under version control
      )

(column-number-mode 1)

(use-package dired
  :elpaca nil
  :custom
  ;; Allow dired to delete or copy a dir.
  ;; 02/14/24 17:41:48 - These default to 'top in dired now.
  ;; 'top means ask every time.
  ;; 'always means don't ask.
  (dired-recursive-copies 'top)
  (dired-recursive-deletes 'top)
  :config

  ;; Open marked files in dired
  ;; http://xahlee.info/emacs/emacs/emacs_dired_open_marked.html
  (defun xah-dired-open-marked ()
    "Open marked files in `dired'.
URL `http://xahlee.info/emacs/emacs/emacs_dired_open_marked.html'
Version 2019-10-22"
    (interactive)
    (mapc 'find-file (dired-get-marked-files)))

  ;; Make dired open in the same window when using RET or ^
  ;; Make Dired only use a single buffer when visiting a directory.
  ;; http://ergoemacs.org/emacs/emacs_dired_tips.html
  (put 'dired-find-alternate-file 'disabled nil) ; disables warning
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file) ; was dired-advertised-find-file
  (define-key dired-mode-map (kbd "^") (lambda ()
                                         (interactive)
                                         (find-alternate-file ".."))))  ; was dired-up-directory

(setq savehist-file (expand-file-name "savehist" deftpunk--var-dir)
      history-length 65                                                ; reducing size helps reduce startup cost.
      history-delete-duplicates t
      savehist-save-minibuffer-history t
      savehist-additional-variables '(kill-ring
                                      search-ring
                                      mark-ring
                                      global-mark-ring
                                      regexp-search-ring
                                      extended-command-history
                                      regexp-search-ring))
(savehist-mode 1)

;; Limit some of the items in savehist
(put 'savehist-minibuffer-history-variables 'history-length 50)
(put 'org-read-date-history                 'history-length 50)
(put 'read-expression-history               'history-length 50)
(put 'org-table-formula-history             'history-length 50)
(put 'extended-command-history              'history-length 50)
(put 'ido-file-history                      'history-length 50)
(put 'helm-M-x-input-history                'history-length 50)
(put 'minibuffer-history                    'history-length 50)
(put 'ido-buffer-history                    'history-length 50)
(put 'buffer-name-history                   'history-length 50)
(put 'file-name-history                     'history-length 50)

(setq save-place-file (expand-file-name "emacs-places" deftpunk--var-dir)
      save-place-forget-unreadable-files nil  ; Setting to t has the potential to make exiting slow
      )
(save-place-mode 1)
(add-hook 'save-place-find-file-hook 'recenter)
(add-hook 'find-file-hook 'save-place-find-file-hook t)

(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(global-visual-line-mode)
(blackout 'visual-line-mode)

;; Ignore all the *<name>* buffers by regex.
(setq winner-boring-buffers-regexp "^\\*")
(winner-mode +1)

(use-package ace-window
  :bind (("C--" . ace-window))
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)
        aw-leading-char-style 'path
        aw-background t
        aw-dispatch-always t)
  :config
  (set-face-attribute 'aw-leading-char-face nil :height 4.0))

(use-package ace-link
  :init (ace-link-setup-default))

(use-package emacs
  :elpaca nil
  :config
  (defadvice keyboard-escape-quit
      (around keyboard-escape-quit-dont-close-windows activate)
    (let ((buffer-quit-function (lambda () ())))
      ad-do-it)))

(use-package ws-butler
  :elpaca (ws-butler :type git :host github :repo "hlissner/ws-butler")
  :blackout t
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode))
  :custom
  (ws-butler-keep-whitespace-before-point nil))

;; show trailing whitespace
(setq show-trailing-whitespace t)

(with-eval-after-load 'ws-butler
  (blackout 'ws-butler-mode))

(use-package devdocs
  :init
  (setq devdocs-data-dir (expand-file-name "devdocs" user-emacs-directory)))
