init.el

(use-package devdocs-browser
  :commands (devdocs-browser-open)
  :general ("C-h D" #'devdocs-browser-open))

(use-package discover-my-major
  :general
  ("C-h C-m" #'discover-my-major))

(use-package helpful
  :general
  ([remap describe-function]  #'helpful-callable
   [remap describe-command]   #'helpful-command
   [remap describe-variable]  #'helpful-variable
   [remap display-local-help] #'helpful-at-point
   [remap describe-symbol]    #'helpful-symbol
   [remap describe-key]       #'helpful-key
   "C-h x"                    #'helpful-macro))

;; Make all the lines soft-wrap
(use-package org
  :elpaca nil
  :blackout (org-mode . " Org")
  :hook (org-mode . (lambda ()
          (toggle-truncate-lines nil)))
  :general
  (:keymaps 'org-mode-map
        "C-c C-'" 'org-edit-special)
  (:keymaps 'org-src-mode-map
        "C-c C-'" 'org-edit-src-exit)
  :custom
  (org-use-speed-commands t)      ; faster navigation
  (org-fontify-quote-and-verse-blocks t)    ; quote/verse blocks show up better
  (org-return-follows-link t)
  (org-src-fontify-natively t)
  (org-startup-indented t)
  (org-pretty-entities t)
  (org-hide-emphasis-markers t)       ; show italicized text instead of /italicized text/
  (org-startup-with-inline-images t)
  (org-image-actual-width '(300))
  :init
  ;; Load markdown as well as emacs-lisp
  ;; Add/Create function for executing markdown or send to previewer
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  :config
  ;; Moving general bindings here to reduce startup penalty.

  ;; Create a sparse tree view of TODOs in the current Org buffer.
  ;; https://stackoverflow.com/a/63195446
  ;; You can use C-x 4 0 to kill the buffer and window when done.
  (defun org-todo-buffer ()
    "Create new indirect buffer with sparse tree of undone TODO items"
    (interactive)
    (clone-indirect-buffer "*org TODO undone*" t)
    (org-show-todo-tree nil) ; mimics interactive usage
    (org-remove-occur-highlights))

  ;; Keys for org-mode-map
  (general-define-key
   :keymaps 'org-mode-map
   ;; so that C-j actually is mapped to avy-goto-char-timer
   "C-j" 'nil
   "C-k" 'nil
   ;; so that we can use it as help prefix
   "M-h" 'nil)

  ;; Local leader bindings.
  (deftpunk-local-leader-def
    :keymaps 'org-mode-map
    "a" '(org-todo-buffer :which-key "Show TODOs for current buffer.")
    "d" '(org-todo :which-key "Org Todo + Todo States")
    "e" '(org-edit-special :which-key "Edit blk in special buffer")
    "h" '(consult-org-heading :which-key "Org Headers")
    "i" '(org-insert-link :which-key "Org Insert link")
    "n" '(org-babel-next-src-block :which-key "Go to the next src block")
    "o" '(ace-link-org :which-key "Links in Org mode document")
    "p" '(org-babel-previous-src-block :which-key "Go to previous src block")
    "s" '(org-insert-structure-template :which-key "Insert templates")
    "t" '(org-babel-tangle :which-key "Tangle the src blocks")
    "u" '(org-babel-goto-src-block-head :which-key "Go to the head of the src block")
    "x" '(org-open-at-point :which-key "Open link at point")
    "y" '(org-download-screenshot file :which-key "Yank screenshot"))
  )

;; More "keep off my modeline"
(with-eval-after-load 'org-indent
  (blackout 'org-indent-mode))

(use-package org-appear
  :blackout t
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-auto-keywards))

(use-package org-auto-tangle
  :hook (org-mode . org-auto-tangle-mode))

;; The joys of hooks and loading.
(with-eval-after-load 'org-auto-tangle
  (blackout 'org-auto-tangle-mode))

;; https://github.com/minad/org-modern/issues/106#issuecomment-1344659316
;; Fixes issue mentioned above
(defun disable-point-adjustment (&rest args)
  (setq disable-point-adjustment t))
(advice-add 'org-beginning-of-line :after #'disable-point-adjustment)

(use-package org-modern
  :blackout
  :after org
  :init
  (setq org-modern-hide-stars nil
        ;; I prefer just the circle
        org-modern-star '("○" "○" "○" "○" "○" "○")
        org-auto-align-tags nil
        org-tags-column 0
        org-catch-invisible-edits 'show-and-error
        org-special-ctrl-a/e t
        org-insert-heading-respect-content t

        ;; Org styling, hide markup etc.
        org-ellipsis "…"

        ;; Agenda styling
        org-agenda-tags-column 0
        org-agenda-block-separator ?─
        org-agenda-time-grid
        '((daily today require-timed)
          (800 1000 1200 1400 1600 1800 2000)
          " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
        org-agenda-current-time-string
        "⭠ now ─────────────────────────────────────────────────")
  :config
  (global-org-modern-mode))
