dftpnk-emacs.org
*** [[https://github.com/emacsorphanage/git-gutter][git-gutter]] & [[https://github.com/emacsorphanage/git-gutter-fringe][git-gutter-fringe]]

TODO: set faces.

 #+begin_src emacs-lisp :name some-fringe
  ;; From Doom Emacs ui/vc-gutter/config.el
  ;; UI: make the fringe small enough that the diff bars aren't too domineering,
  ;;   while leaving enough room for other indicators.
  (if (fboundp 'fringe-mode) (fringe-mode '8))
  ;; UI: the gutter looks less cramped with some space between it and  buffer.
  (setq-default fringes-outside-margins t)
#+end_src

#+begin_src emacs-lisp :name git-gutter
  (use-package git-gutter
    :hook ((org-mode . git-gutter-mode)
           (org-src-mode . git-gutter-mode)
           (prog-mode . git-gutter-mode)
           (markdown-mode . git-gutter-mode))
    :custom
    (git-gutter:update-interval 0.05)
    (git-gutter:disabled-modes '(fundamental-mode image-mode pdf-vew-mode))
    ;; Don't go looking for backends I don't use.
    (git-gutter:handled-backends '(git))
    ;; Don't ask to commit/revert
    (git-gutter:ask-p nil)
    :config
    ;; UX: update git-gutter on focus (in case I was using git externally)
    (add-hook 'focus-in-hook #'git-gutter:update-all-windows)

    ;; Stop git-gutter doing things when we don't want
    (remove-hook 'post-command-hook #'git-gutter:post-command-hook)
    (advice-remove #'quit-window #'git-gutter:quit-window)
    (advice-remove #'switch-to-buffer #'git-gutter:switch-to-buffer)

    (defhydra hydra-git-gutter (:body-pre (git-gutter-mode 1)
                                          :hint nil)
      "
   Git gutter:
     _j_: next hunk        _s_tage hunk     _q_uit
     _k_: previous hunk    _r_evert hunk    _Q_uit and deactivate git-gutter
     ^ ^                   _p_opup hunk
     _h_: first hunk
     _l_: last hunk        set start _R_evision
   "
      ("j" git-gutter:next-hunk)
      ("k" git-gutter:previous-hunk)
      ("h" (progn (goto-char (point-min))
                  (git-gutter:next-hunk 1)))
      ("l" (progn (goto-char (point-min))
                  (git-gutter:previous-hunk 1)))
      ("s" git-gutter:stage-hunk)
      ("r" git-gutter:revert-hunk)
      ("p" git-gutter:popup-hunk)
      ("R" git-gutter:set-start-revision)
      ("q" nil :color blue)
      ("Q" (progn (git-gutter-mode -1)
                  ;; git-gutter-fringe doesn't seem to
                  ;; clear the markup right away
                  (sit-for 0.1)
                  (git-gutter:clear))
       :color blue)))
#+end_src

#+begin_src emacs-lisp :name git-gutter-fringe
  (use-package git-gutter-fringe
    :config
    ;; Make added/modified a bar & deleted a triangle.
    (define-fringe-bitmap 'git-gutter-fr:added [#b11100000] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [#b11100000] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted
      [#b10000000
       #b11000000
       #b11100000
       #b11110000] nil nil 'bottom))

  ;; Turn off git-gutter in the modeline.
  (blackout 'git-gutter-mode)
#+end_src

*** [[https://gitlab.com/pidu/git-timemachine][git-timemachine]]

Step through historic versions of a git controlled file.

Visit a git-controlled file and issue M-x git-timemachine (or bind it to a keybinding of your
choice). If you just need to toggle the time machine you can use M-x git-timemachine-toggle.

Use the following keys to navigate historic version of the file

p Visit previous historic version
n Visit next historic version
w Copy the abbreviated hash of the current historic version
W Copy the full hash of the current historic version
g Goto nth revision
t Goto revision by selected commit message
q Exit the time machine.
b Run magit-blame on the currently visited revision (if magit available).
c Show current commit using magit (if magit available).

#+begin_src emacs-lisp :name git-timemachine
    (use-package git-timemachine
      :config
      (setq git-timemachine-abbreviation-length 14
            git-timemachine-show-minibuffer-details t)
      (elpaca-wait))

    ;; From redguardtoo - http://blog.binchen.org/posts/new-git-timemachine-ui-based-on-ivy-mode.html
    (defun my-git-timemachine-show-selected-revision ()
      "Show last (current) revision of file."
      (interactive)
      (let (collection)
        (setq collection
              (mapcar (lambda (rev)
                        ;; re-shape list for the ivy-read
                        (cons (concat (substring (nth 0 rev) 0 7) "|" (nth 5 rev) "|" (nth 6 rev)) rev))
                      (git-timemachine--revisions)))
        (ivy-read "commits:"
                  collection
                  :action (lambda (rev)
                            (git-timemachine-show-revision rev)))))

    (defun my-git-timemachine ()
      "Open git snapshot with the selected version.  Based on ivy-mode."
      (interactive)
      (unless (featurep 'git-timemachine)
        (require 'git-timemachine))
      (git-timemachine--start #'my-git-timemachine-show-selected-revision))
#+end_src

*** [[https://magit.vc/][Magit]] & Forge

The absolutely best git porcelain on Planet Earth.

Some more informational links:
https://emacsair.me/2017/09/01/magit-walk-through/
https://emacsair.me/2017/09/01/the-magical-git-interface/
https://www.masteringemacs.org/article/introduction-magit-emacs-mode-git

#+begin_src emacs-lisp :name magit
  (use-package magit
    :commands (magit-dispatch)
    :general
    (:prefix "C-x"
             "g" 'magit-status
             "C-g" 'magit-status)
    :hook (git-commit-setup-hook . git-commit-turn-on-flyspell)
    :init
    (if IS-MAC
        (setq magit-git-executable "/opt/homebrew/bin/git")
      (setq magit-git-executable "/usr/local/bin/git"))
    :config
    ;; Add git-timemachine to the magit-dispatch transient map.
    (transient-append-suffix 'magit-dispatch '(0 -1 -1) '("S" "git timemachine" git-timemachine))

    (setq  magit-log-arguments '("--graph" "--decorate" "--color")
           magit-revert-buffers 'silent
           magit-revision-show-gravatars '("^Author:     " . "^Commit:     ")
           magit-diff-refine-hunk t ; show granular diffs in selected hunk
           ;; Don't autosave repo buffers. This is too magical, and saving can
           ;; trigger a bunch of unwanted side-effects, like save hooks and
           ;; formatters. Trust us to know what we're doing.
           magit-save-repository-buffers nil))

  (use-package forge
    :after magit)
#+end_src

TODO: Another codereview from magit tool https://github.com/blahgeek/emacs-pr-review for doing reviews with GitHub
TODO: fixes code-review: https://github.com/wandersoncferreira/code-review/pull/246#issuecomment-1867538123

**** [[https://github.com/alphapapa/magit-todos][magit-todos]]

Show TODOs in Magit status buffer for each source file.

#+begin_src emacs-lisp :name magit-todos
  (use-package magit-todos
    :after magit
    :config
    (magit-todos-mode +1))
#+end_src

** General Software Development
*** lispy

TODO: Enable lispy.

** Python

*** [[https://github.com/necaris/conda.el][conda]]

For working with miniconda and conda environments; which I prefer to other Python virtual environments.

Using with Tramp & Docker:
https://www.reddit.com/r/emacs/comments/kymvrz/emacs_lsp_with_docker_conda/
https://github.com/necaris/conda.el/issues/30

#+begin_src emacs-lisp :name conda
  (use-package conda
    :after python
    :config
    ;; taken from doom
    ;; The location of your anaconda home will be guessed from a list of common
    ;; possibilities, starting with `conda-anaconda-home''s default value (which
    ;; will consult a ANACONDA_HOME envvar, if it exists).
    ;;
    ;; If none of these work for you, `conda-anaconda-home' must be set
    ;; explicitly. Afterwards, run M-x `conda-env-activate' to switch between
    ;; environments
    (or (cl-loop for dir in (list conda-anaconda-home
                                  "~/.miniconda3"
                                  "~/.conda")
                 if (file-directory-p dir)
                 return (setq conda-anaconda-home (expand-file-name dir)
                              conda-env-home-directory (expand-file-name dir)))
        (message "Cannot find Anaconda installation"))
    ;; integration with term/eshell
    (conda-env-initialize-interactive-shells)
    (after! eshell (conda-env-initialize-eshell))

    ;; auto-activation (see below for details)
    ;; (conda-env-autoactivate-mode t)
    ;; automatically activate a conda environment on the opening of a file:
    ;; (add-hook 'find-file-hook (lambda () (when (and (bound-and-true-p conda-project-env-path) (string-match "\\.py\\'" buffer-file-name))
    ;;                                       (conda-env-activate-for-buffer))))

    ;; Add to the modeline so that we know which env is activated.
    (add-to-list 'global-mode-string
                 '(conda-env-current-name (" conda:" conda-env-current-name " "))
                 'append))
#+end_src

** Miscellaneous File types
*** Markdown
