dftpnk-emacs.org
**** [[http://jblevins.org/projects/markdown-mode/][Markdown Mode]]

Major mode for editing [[http://daringfireball.net/projects/markdown/][Markdown]] formatted text.

#+begin_src emacs-lisp :name markdown
  (use-package markdown-mode
    :defer t
    :commands (markdown-mode gfm-mode)
    :hook (markdown-mode . flyspell-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'"       . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init
    (setq markdown-command "/opt/homebrew/bin/multimarkdown"
          markdown-header-scaling t)
    )
#+end_src

** Terminals & Shells

Terminals, shells, consoles ... oh my.

*** [[https://github.com/akermu/emacs-libvterm][vterm]]

A fully-fledged terminal emulator inside GNU Emacs based on libvterm - which will need to be compiled.

Don't forget to do the following [[https://github.com/akermu/emacs-libvterm?tab=readme-ov-file#shell-side-configuration][shell-side-configuration]] in =.zshrc=

TODO: toggle-vterm or multi-vterm?

#+begin_src emacs-lisp :name vterm
  (use-package vterm
    :ensure t
    :hook
    ;; Change the face so its more obvious we are in an emulator.
    (vterm-mode . (lambda ()
                    (set (make-local-variable 'buffer-face-mode-face) 'fixed-pitch)
                    (buffer-face-mode t)))
    :custom
    (vterm-always-compile-module t)
    (vterm-max-scrollback 100000)               ; the max without changing vterm-module.h and re-compiling
    (vterm-copy-mode-remove-fake-newlines t))
#+end_src

** Keybindings and related functionality
*** Matching parens ala %

#+begin_src emacs-lisp :name matching-parens
  ;; Trying out matching parens
  ;; https://www.gnu.org/software/emacs/manual/html_node/efaq/Matching-parentheses.html
  (defun match-paren (arg)
    "Go to the matching paren if on a paren; otherwise insert %."
    (interactive "p")
    (cond ((looking-at "\\s(") (forward-list 1) (backward-char 1))
          ((looking-at "\\s)") (forward-char 1) (backward-list 1))
          (t (self-insert-command (or arg 1)))))

  (global-set-key "%" 'match-paren)
#+end_src

*** Making escape do more quiting.

I might as well take advantage of my Neovim habit.

#+begin_src emacs-lisp :name escape
  ;; Some final remapping of Escape to "Quit"

  (global-set-key (kbd "<escape>") 'keyboard-quit)

  ;; When C-g gets rebound.
  (define-key key-translation-map (kbd "ESC") (kbd "C-g"))

  (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
#+end_src

*** Rectangle hydra

A Hydra for dealing w/ rectangle selection.
https://oremacs.com/2015/02/25/rectangle-hydra/

#+begin_src emacs-lisp :name rectangle-hydra
  (defun ora-ex-point-mark ()
    (interactive)
    (if rectangle-mark-mode
        (exchange-point-and-mark)
      (let ((mk (mark)))
        (rectangle-mark-mode 1)
        (goto-char mk))))

  (defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
                             :color pink
                             :post (deactivate-mark))
    "
    ^_k_^     _d_elete    _s_tring     |\\     ‗,,,--,,‗
  _h_   _l_   _o_k        _y_ank       /,`.-'`'   .‗  \-;;,‗
    ^_j_^     _n_ew-copy  _r_eset     |,4-  ) )‗   .;.(  `'-'
  ^^^^        _e_xchange  _u_ndo     '---''(‗/.‗)-'(‗\‗)
  ^^^^        ^ ^         _p_aste
  "
    ("h" backward-char nil)
    ("l" forward-char nil)
    ("k" previous-line nil)
    ("j" next-line nil)
    ("e" ora-ex-point-mark nil)
    ("n" copy-rectangle-as-kill nil)
    ("d" delete-rectangle nil)
    ("r" (if (region-active-p)
             (deactivate-mark)
           (rectangle-mark-mode 1)) nil)
    ("y" yank-rectangle nil)
    ("u" undo nil)
    ("s" string-rectangle nil)
    ("p" kill-rectangle nil)
    ("o" nil nil))

  (global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)
#+end_src

*** deftpunk-g-def bindings

Just like the Neovim "g<letter>" bindings.

#+begin_src emacs-lisp :name deftpunk-g-def
  ;; NOTE: The org-open-at-point will open a "Babel Results" window when this function is called
  ;;       inside a src block
  (defun deftpunk/url-at-point ()
    "Make opening the url at point a little more flexible."
    (interactive)
    (if (string-equal major-mode "org-mode")
        (unless (ignore-errors (or (org-open-at-point) t))
          (ace-link))
      (unless (ignore-errors (or (browse-url-at-point) t))
        (ace-link))))

  (general-create-definer deftpunk-g-def
    :keymaps 'override
    :prefix "s-g"
    "g" goto-line
    "s-g" goto-line
    "o" ace-link
    "x" deftpunk/url-at-point
    )
#+end_src

*** Window management/navigation bindings

#+begin_src emacs-lisp :name windows-bindings
  (global-set-key (kbd "C--") 'ace-window)

  ;; Move around
  (global-set-key (kbd "s-h") 'windmove-left)
  (global-set-key (kbd "s-j") 'windmove-down)
  (global-set-key (kbd "s-k") 'windmove-up)
  (global-set-key (kbd "s-l") 'windmove-right)
#+end_src

*** Some aliases

#+begin_src emacs-lisp :name defaliases
  (defalias 'ff 'find-file)
#+end_src

*** Deftpunk keybindings

#+begin_src emacs-lisp :name deftpunk-keybindings
  ;; Using C-j for jumping around.
  (global-unset-key (kbd "C-j"))
  (global-set-key (kbd "C-j") 'avy-goto-char-timer)
  (global-set-key (kbd "s-f") 'avy-goto-char-in-line)

  (global-set-key (kbd "s-s") 'my/consult-ripgrep-or-line)

  ;; Figure out hippie-expand
  ;; From https://stackoverflow.com/a/43665319
  (defun my-expand-lines ()
    "My old friend C-x C-l in Emacs"
    (interactive)
    (let ((hippie-expand-try-functions-list
       '(try-expand-line)))
      (call-interactively 'hippie-expand)))

  (global-unset-key (kbd "C-x C-l")) ; I can downcase the region another way.
  (global-set-key (kbd "C-x C-l") 'my-expand-lines)
#+end_src

*** Some function based abbreviations

#+begin_src emacs-lisp :name function-abbreviations
  (defun deftpunk/current-time ()
    (interactive)
    (insert (format-time-string "%D %T")))
  (define-abbrev global-abbrev-table "ydate" "" 'deftpunk/current-time)
#+end_src

*** [[https://www.emacswiki.org/emacs/key-chord.el][key-chord]]

Map pairs of simultaneously pressed keys to commands.

Keychord does have some drawbacks:
1. Doesn't get recorded when recording macros.
2. Can't use function keys in keychords
3. Doesn't work well with internationalization packages.

I use something similar in Neovim to bring up ":"

#+begin_src emacs-lisp :name jk-binding
  (use-package key-chord
    :commands (key-chord-define-global)
    :init
    (key-chord-mode 1)
    :config
    (key-chord-define-global "jk" 'execute-extended-command)
    (key-chord-define-global "hh" 'split-window-below)
    (key-chord-define-global "vv" 'split-window-right))
#+end_src

** Server

Start the emacs server as a last thing to do.

#+begin_src emacs-lisp :name emacs-server
  (server-start)
#+end_src
